[
  {
    "name": "Headache that won't go away or gets worse over time",
    "image": "assets/danger_sign/headache_image01.jpg",
    "description": "Doctors don't fully understand what causes most headaches. They do know that the brain tissue and the skull are never responsible since they don't have nerves that register pain. But the blood vessels in the head and neck can signal pain, as can the tissues that surround the brain and some major nerves that originate in the brain. The scalp, sinuses, teeth, and muscles and joints of the neck can also cause head pain."
  },
  {
    "name": "Dizziness or fainting",
    "image": "assets/danger_sign/dizziness_image02.jpg",
    "description": "Dizziness is when you feel light-headed, weak, unsteady or as if you might faint. Many pregnant women feel dizzy at times. It is sometimes the first sign that you are pregnant. Dizziness is common in weeks 0 to 13 of pregnancy. The main causes of dizziness and fainting during pregnancy are: Hormone changes - this can cause your blood pressure to drop, allowing less blood to get to your brain, Overheating, Low blood sugar, - keep a snack with you and avoid skipping meals, Low iron levels, Reduced circulation - as your womb grows it will put pressure on the blood vessels in the lower part of your body, Lying on your back."
  },
  {
    "name": "Thoughts about hurting yourself or your baby",
    "image": "assets/danger_sign/hurting_thoughts_image03.jpg",
    "description": "Intrusive thoughts are key features of depression, anxiety, and obsessive-compulsive disorder (OCD). Such thoughts are also common in the general population, where their content is the same as found in those with a psychiatric disorder. Intrusive thoughts comprise unwanted negative thoughts and images that frequently intrude, are difficult to dismiss, and, when dismissed, recur. Furthermore, they lead to a narrowed focus of attention that, in turn, can impair a person's ability to respond to the external world. They can play an important role in maintaining the disorders in which they occur. One form of intrusive thoughts that is particularly distressing in the postnatal period is of intentionally harming one's infant. Such thoughts and images have been writed to occur in very nearly half of parents of infants in the general population. Although such intrusions are not in themselves indicative of risk, they are likely to be of particular significance when they occur as part of depression, anxiety disorders, or OCD, where they are often associated with great distress and shame. Although much of the research in this area has been with mothers, these intrusive thoughts also frequently occur in fathers."
  },
  {
    "name": "Chaests in your vision",
    "image": "assets/food_list/month04.jpg",
    "description": "Eye floaters are spots in your vision. They may look to you like black or gray specks, strings, or cobwebs that drift about when you move your eyes and appear to dart away when you try to look at them directly. Most eye floaters are caused by age-related changes that occur as the jelly-like substance (vitreous) inside your eyes becomes more liquid. Microscopic fibers within the vitreous tend to clump and can cast tiny shadows on your retina. The shadows you see are called floaters. If you notice a sudden increase in eye floaters, contact an eye specialist immediately - especially if you also see light flashes or lose your peripheral vision. These can be symptoms of an emergency that requires prompt attention."
  },
  {
    "name": "Fever",
    "image": "assets/danger_sign/fever_image05.jpg",
    "description": "During pregnancy, even a mild fever should be monitored closely. A low-grade fever lasting more than 24 hours or a fever of 38.5°C or higher can be harmful to the pregnancy, as it may indicate an infection. Infections are a common cause of preterm birth. Fevers during pregnancy are never normal, so an exam is always recommended. Luckily, if the fever was caused by a viral illness, hydration and Tylenol are usually enough for recovery. But if the cause is bacterial, an antibiotic is often needed. Pregnant women should not take aspirin or ibuprofen. The most important thing is to see your doctor for proper treatment."
  },
  {
    "name": "Trouble breathing",
    "image": "assets/danger_sign/trouble_breathing_image06.jpg",
    "description": "Shortness of breath is a common symptom affecting people during pregnancy. It can begin in the first trimester and may get worse over time due to increased pressure from the fetus on the diaphragm and hormonal changes.Shortness of breath in pregnancy is usually harmless. A person can usually treat it with some home remedies, and it should go away on its own after delivery. In some cases, shortness of breath during pregnancy can have other underlying causes and may be more severe. Contacting a doctor can help a person determine whether they need medical treatment."
  },
  {
    "name": "Chest pain or fast-beating heart",
    "image": "assets/danger_sign/heart_palpitations_image07.jpg",
    "description": "Heart palpitations cause your heart to feel like it’s pounding, racing or beating too quickly. Your heart rate might speed up, slow down or skip a beat. Some people feel like they have an extra heartbeat. Heart palpitations in pregnancy are very common. During pregnancy, the amount of blood in your body increases significantly. Your heart works harder to pump the extra blood throughout your body and to your baby. This extra work can result in heart palpitations. Although they can be alarming, most pregnancy heart palpitations aren’t dangerous. They usually go away after delivery. Less commonly, heart palpitations can be a sign of a serious health problem, such as arrhythmia (abnormal heart rhythm). If you have palpitations along with chest pain, trouble breathing, dizziness or confusion, get immediate medical help."
  },
  {
    "name": "Serve belly pain that doesn't go away",
    "image": "assets/danger_sign/belly_pain_image08.jpg",
    "description": "You know that awful feeling: you're nauseous; your stomach feels like it's tied in a knot, and you don't even want to move. What does your pain mean? Well, let's talk today about abdominal pain. So, what causes abdominal pain? Almost everyone has pain in their belly at one time or another. Most of the time, a serious medical problem is not the cause, and how bad your pain is doesn't always reflect the seriousness of the problem causing your pain. You may feel very bad pain if you are having gas or stomach cramps due to viral gastroenteritis, better known as a stomach virus. And some life-threatening conditions, such as colon cancer or a very early case of appendicitis, may cause only mild pain, or no pain at all. The important thing to know about abdominal pain is when you need immediate medical care. Less serious causes of abdominal pain include constipation, irritable bowel syndrome, food allergies, lactose intolerance, food poisoning, and a stomach virus. Other, more serious, causes include appendicitis, an abdominal aortic aneurysm, a bowel blockage, cancer, and gastroesophageal reflux. Sometimes, you may have abdominal pain from a problem that isn't in your belly, like a heart attack, menstrual cramps, or pneumonia. So, what do you do about abdominal pain? Well, if you have mild abdominal pain, here are some helpful tips; Try sipping water or other clear fluids. Avoid solid food for the first few hours. If you've been vomiting, wait 6 hours and then eat small amounts of mild foods like rice, applesauce, or crackers. If your pain is high in your abdomen and occurs after meals, antacids may help, especially if you are feeling heartburn or indigestion. You should seek medical attention if you have abdominal pain and are being treated for cancer, you can't pass any stool, you're vomiting blood, or you have chest, neck, or shoulder pain. Call your doctor if you have abdominal pain that lasts 1 week or longer, if your pain doesn't improve in 24 to 48 hours, if bloating lasts more than 2 days, or if you have diarrhea for more than 5 days."
  },
  {
    "name": "Baby's movements stopping or slowing",
    "image": "assets/danger_sign/baby_movement_image09.jpg",
    "description": "Fetal movements can be anything from a flutter, kick, swish or roll. These can be felt as early as 18 weeks of pregnancy (or even sooner in later pregnancies), but many women don't feel them until later. You may be able to feel the baby move as early as 18 weeks into your pregnancy. If it is your second or third baby, you may feel the movement even earlier. However, baby movements before 28 weeks can be changeable and not have a regular pattern.This could be because of the baby's position in the womb or the position of the placenta. It is also likely to be due to the fact the baby is small at this time, and therefore has smaller movements. If you have been on your feet or busy all day, you are also less likely to feel the baby's movements than when you are resting. Babies should continue to move normally throughout pregnancy and you should even continue to feel them while you are in labor. As babies get big the movements feel different but they should still follow their usual pattern right up to the end. It is not true that babies 'slow down' as labor approaches, but they have less space to move in. During your pregnancy you should try to be aware of your baby's movement patterns. If the movements slow down or change it could be a sign that your baby is unwell and you should contact your midwife immediately."
  },
  {
    "name": "Overwhelming tirdness",
    "image": "assets/danger_sign/tired_pregnant_image10.jpg",
    "description": "It's common to feel tired, or even exhausted, during pregnancy, especially in the first 12 weeks. Hormonal changes at this time can make you feel tired, nauseous and emotional. The only answer is to rest as much as possible. Make time to sit with your feet up during the day, and accept any offers of help from colleagues and family. Being tired and run-down can make you feel low. Try to look after your physical health - make sure you eat a healthy diet, and get plenty of rest and sleep. Later in pregnancy, you may feel tired because of the extra weight you're carrying. Make sure you get plenty of rest. As your bump gets bigger, it can be difficult to get a good night's sleep. You might find that lying down is uncomfortable or that you need to use the loo a lot. Feeling tired will not harm you or your baby, but it can make life feel more difficult, especially in the early days before you've told people about your pregnancy."
  }
]
