[
  {
    "title": "Eat healthy foods",
    "image": "assets/pregnancy_care/image02.jpg",
    "description": "Eating healthy foods is especially important for pregnant women. Your baby needs nutrients to grow healthy and strong in the womb. Eat plenty of colorful fruits and vegetables, whole grains, calcium-rich foods and foods low in saturated fat."
  },
  {
    "title": "Take a daily prenatal vitamin.",
    "image": "assets/avatar.jpg",
    "description": "Taking a daily prenatal multivitamin can help ensure you get the right amount of the key nutrients you and your baby need during pregnancy. These include folic acid, iron and calcium."
  },
  {
    "title": "Stay hydrated",
    "image": "assets/avatar.jpg",
    "description": "A pregnant woman's body needs more water than it did before pregnancy. Aim for eight or more cups each day."
  },
  {
    "title": "Go to your prenatal care checkups",
    "image": "assets/avatar.jpg",
    "description": "Women should get regular prenatal care from a health care provider. Moms who don’t get regular prenatal care are much more likely to have a baby with low birth weight or other complications. If available, consider group prenatal care."
  },
  {
    "title": "Avoid certain foods",
    "image": "assets/avatar.jpg",
    "description": "There are certain foods that women should avoid eating while pregnant. Don't eat: Raw or rare meats. Liver, sushi, raw eggs (also in ayonnaise). Soft cheeses (feta, brie). Unpasteurized milk. Raw and unpasteurized animal products can cause food poisoning. Some fish, even when cooked, can be harmful to a growing baby because they're high in mercury."
  },
  {
    "title": "Don't drink alcohol",
    "image": "assets/avatar.jpg",
    "description": "Don't drink alcohol before and during pregnancy and while breastfeeding. Drinking alcohol increases the risk of having a baby with fetal alcohol spectrum disorder (FASD). FASD can cause abnormal facial features, severe learning disabilities and behavioral issues."
  },
  {
    "title": "Don't smoke",
    "image": "assets/pregnancy_care/image03.png",
    "description": "Smoking is unhealthy for you and your unborn child. It increases the risk of sudden infant death syndrome (SIDS), premature birth, miscarriage and other poor outcomes."
  },
  {
    "title": "Get moving",
    "image": "assets/pregnancy_care/image01.jpg",
    "description": "Daily exercise or staying active in other ways can help you stay healthy during pregnancy. Check with your doctor to find out how much physical activity is right for you."
  },
  {
    "title": "Get a flu shot",
    "image": "assets/avatar.jpg",
    "description": "The flu can make a pregnant woman very sick and increase risks of complications for your baby. The flu shot can protect you from serious illness and help protect your baby after birth, too. Ask your doctor about getting a flu shot."
  },
  {
    "title": "Get plenty of sleep",
    "image": "assets/avatar.jpg",
    "description": "Ample sleep (7 to 9 hours) is important for you and your baby. Try to sleep on your left side to improve blood flow."
  },
  {
    "title": "Reduce stress",
    "image": "assets/avatar.jpg",
    "description": "Reducing stress is crucial for improving birth outcomes. Pregnant women should avoid, as much as they can, stressful situations. Recruit your loved ones to help you manage stress in your life."
  },
  {
    "title": "Plan the right time to get pregnant",
    "image": "assets/avatar.jpg",
    "description": "If you are choosing to become pregnant at a time when you know that you're at your healthiest, that increases your chances of having a healthy pregnancy and a healthy birth,"
  }
  
]
