Repository: fasil712/mhis_mobile_app
Catalog: lib/l10n/app_*.arb
Languages: am

# homePage
source: MHIS
am: የእናቶች ጤና አጠባበቅ

source: Services
am: አገልግሎቶች

source: Doctors
am: ዶክተሮች

# preg_care
source: Pregnancey Care
am: የእርግዝና እንክብካቤ

# danger_sign
source: Danger Sign During Pregnancy
am: በእርግዝና ወቅት የአደገኛ ምልክት

# preg_diet
source: Diet During Pregnancy
am: በእርግዝና ወቅት አመጋገብ

# bmi
source: Body Mass Index
am: የሰውነት ብዛት መረጃ ጠቋሚ

# edd
source: Estimated Date of Delivery
am: ነፍሰ ጡር እናት መዉለጃ ቀን ገምት

source: Login
am: ግባ

source: Help
am: እርዳታ

source: Feedback
am: ግብረ መልስ

source: Share
am: አጋራ

source: More
am: ተጨማሪ

# bmi_desc
source: It measure of overweight and obesity
am: ከመጠን በላይ ክብደት እና ከመጠን በላይ ውፍረት ይለካል

# danger_sign_desc
source: Headache that won't go away or gets worse over time
am: የማይጠፋ ወይም ከጊዜ ወደ ጊዜ እየባሰ የሚሄድ ራስ ምታት

# preg_care_desc
source: Take a daily prenatal vitamin
am: በየቀኑ የቅድመ ወሊድ ቫይታሚን ይውሰዱ

# preg_diet_desc
source: Healthy eating during pregnancy for your baby's growth and development
am: በእርግዝና ወቅት ጤናማ አመጋገብ ለልጅዎ እድገት እና ጤንነት

# edd_desc
source: Estimate pregnant mom delivery date.
am: የነፍሰ ጡር እናት የመውለጃ ቀን ግምት ማስሊያ

# carousel_name01
source: Care for mothers
am: ለእናቶች ጤና እንክብካቤ ስጥ

# carousel_name02
source: A baby fills a place in your heart that you never knew was empty
am: ህጻን በልብህ ውስጥ ባዶ እንደሆነ የማታውቀውን ቦታ ይሞላል

# carousel_name03
source: Improved maternal health benefits the whole of society
am: የእናቶች ጤና መሻሻል መላውን ህብረተሰብ ይጠቅማል

# carousel_name04
source: Pregnancy is getting company inside one's skin
am: እርግዝና በሰው ቆዳ ውስጥ መተባበር ነው

# carousel_name05
source: 9 month preparing to fall in love for a lifetime
am: 9 ወር በህይወት ዘመን በፍቅር ለመውደቅ በመዘጋጀት ላይ

# nav_head
source: Maternal Health Information System
am: የእናቶች ጤና መረጃ ስርዓት

source: About
am: ስለ እኛ
